In [1]:
import pandas as pd

In [2]:
data = {"name" : ["Lalit", "Suraj", "Ankit", "Dharmesh", "Punit", "Rajat", "Sunil", "Vikash", "Shohel"],
       "salary" : [4000000, 3000000, 4000000, 4000000, 2500000, 2800000, 3100000, 4300000, 3900000]}

In [3]:
df = pd.DataFrame(data = data)

In [4]:
df

       name   salary
0     Lalit  4000000
1     Suraj  3000000
2     Ankit  4000000
3  Dharmesh  4000000
4     Punit  2500000
5     Rajat  2800000
6     Sunil  3100000
7    Vikash  4300000
8    Shohel  3900000

In [5]:
df[["name", "salary"]].sort_values(by = ["name", "salary"])

       name   salary
2     Ankit  4000000
3  Dharmesh  4000000
0     Lalit  4000000
4     Punit  2500000
5     Rajat  2800000
8    Shohel  3900000
6     Sunil  3100000
1     Suraj  3000000
7    Vikash  4300000

In [6]:
df[["name", "salary"]].sort_values(by = ["salary", "name"], ascending = [True, False])

       name   salary
4     Punit  2500000
5     Rajat  2800000
1     Suraj  3000000
6     Sunil  3100000
8    Shohel  3900000
0     Lalit  4000000
3  Dharmesh  4000000
2     Ankit  4000000
7    Vikash  4300000

In [7]:
df["salary"].sort_values()

4    2500000
5    2800000
1    3000000
6    3100000
8    3900000
0    4000000
2    4000000
3    4000000
7    4300000
Name: salary, dtype: int64

In [8]:
print(df.describe(), "\n")
print(df["salary"].median())

             salary
count  9.000000e+00
mean   3.511111e+06
std    6.565905e+05
min    2.500000e+06
25%    3.000000e+06
50%    3.900000e+06
75%    4.000000e+06
max    4.300000e+06

3900000.0

In [9]:
df["salary"].value_counts()

4000000    3
3100000    1
4300000    1
3000000    1
3900000    1
2500000    1
2800000    1
Name: salary, dtype: int64

In [10]:
df["salary"].count()

9

In [11]:
df

       name   salary
0     Lalit  4000000
1     Suraj  3000000
2     Ankit  4000000
3  Dharmesh  4000000
4     Punit  2500000
5     Rajat  2800000
6     Sunil  3100000
7    Vikash  4300000
8    Shohel  3900000

In [12]:
df.loc[0, "salary"] = "NaN"

In [13]:
df

       name   salary
0     Lalit      NaN
1     Suraj  3000000
2     Ankit  4000000
3  Dharmesh  4000000
4     Punit  2500000
5     Rajat  2800000
6     Sunil  3100000
7    Vikash  4300000
8    Shohel  3900000

In [14]:
import numpy as np

In [15]:
df.loc[0, "salary"] = np.nan

In [16]:
df

       name   salary
0     Lalit      NaN
1     Suraj  3000000
2     Ankit  4000000
3  Dharmesh  4000000
4     Punit  2500000
5     Rajat  2800000
6     Sunil  3100000
7    Vikash  4300000
8    Shohel  3900000

In [17]:
df["salary"].count()

8

In [18]:
df.loc[1, "salary"] = "l"

In [19]:
df["salary"].count()

8

In [20]:
df.count()

name      9
salary    8
dtype: int64

In [21]:
df

       name   salary
0     Lalit      NaN
1     Suraj        l
2     Ankit  4000000
3  Dharmesh  4000000
4     Punit  2500000
5     Rajat  2800000
6     Sunil  3100000
7    Vikash  4300000
8    Shohel  3900000

In [28]:
print(df.iloc[0], "\n")
print(df.iloc[2]["name"], "\n")
print(df.iloc[2, 1], "\n")

name      Lalit
salary      NaN
Name: 0, dtype: object

Ankit

4000000

In [29]:
type(df)

pandas.core.frame.DataFrame

In [30]:
type(df["salary"])

pandas.core.series.Series

In [37]:
df["name"].apply(lambda x : len(x))

0    5
1    5
2    5
3    8
4    5
5    5
6    5
7    6
8    6
Name: name, dtype: int64

In [38]:
df["salary"].value_counts()

4000000    2
l          1
4300000    1
3100000    1
3900000    1
2500000    1
2800000    1
Name: salary, dtype: int64

In [39]:
df["salary"].count()

8